<a href="https://colab.research.google.com/github/MayureshKudaskar/Git_Code/blob/main/Python_0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [7]:
import pandas as pd
import numpy as np
import matplotlib as mpl
import seaborn as sns

In [9]:
df = pd.read_csv("/content/Salaries.csv",index_col=0)

In [ ]:
df

          discipline  phd  service     sex  salary
rank
Prof               B   56       49    Male  186960
Prof               A   12        6    Male   93000
Prof               A   23       20    Male  110515
Prof               A   40       31    Male  131205
Prof               B   20       18    Male  104800
...              ...  ...      ...     ...     ...
Prof               B   18       10  Female  105450
AssocProf          B   19        6  Female  104542
Prof               B   17       17  Female  124312
Prof               A   28       14  Female  109954
Prof               A   23       15  Female  109646

[78 rows x 5 columns]

In [ ]:
df.head()

     discipline  phd  service   sex  salary
rank
Prof          B   56       49  Male  186960
Prof          A   12        6  Male   93000
Prof          A   23       20  Male  110515
Prof          A   40       31  Male  131205
Prof          B   20       18  Male  104800

In [ ]:
df

In [ ]:
df.head(20)

          discipline  phd  service   sex  salary
rank
Prof               B   56       49  Male  186960
Prof               A   12        6  Male   93000
Prof               A   23       20  Male  110515
Prof               A   40       31  Male  131205
Prof               B   20       18  Male  104800
Prof               A   20       20  Male  122400
AssocProf          A   20       17  Male   81285
Prof               A   18       18  Male  126300
Prof               A   29       19  Male   94350
Prof               A   51       51  Male   57800
Prof               B   39       33  Male  128250
Prof               B   23       23  Male  134778
AsstProf           B    1        0  Male   88000
Prof               B   35       33  Male  162200
Prof               B   25       19  Male  153750
Prof               B   17        3  Male  150480
AsstProf           B    8        3  Male   75044
AsstProf           B    4        0  Male   92000
Prof               A   19        7  Male  107300
Prof               A   29       27  Male  150500

In [ ]:
df.reset_index()

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [ ]:
df.columns

Index(['discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [ ]:
df.dtypes

discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [ ]:
df.axes

[Index(['Prof', 'Prof', 'Prof', 'Prof', 'Prof', 'Prof', 'AssocProf', 'Prof',
        'Prof', 'Prof', 'Prof', 'Prof', 'AsstProf', 'Prof', 'Prof', 'Prof',
        'AsstProf', 'AsstProf', 'Prof', 'Prof', 'AsstProf', 'Prof', 'AsstProf',
        'AsstProf', 'Prof', 'Prof', 'Prof', 'Prof', 'AsstProf', 'Prof',
        'AssocProf', 'Prof', 'Prof', 'Prof', 'AssocProf', 'Prof', 'Prof',
        'Prof', 'AsstProf', 'Prof', 'Prof', 'AssocProf', 'AsstProf', 'AsstProf',
        'Prof', 'Prof', 'AsstProf', 'AssocProf', 'Prof', 'Prof', 'AsstProf',
        'Prof', 'Prof', 'AsstProf', 'AssocProf', 'AsstProf', 'AssocProf',
        'AsstProf', 'Prof', 'AssocProf', 'AsstProf', 'AssocProf', 'AssocProf',
        'Prof', 'AssocProf', 'Prof', 'AsstProf', 'Prof', 'AsstProf', 'Prof',
        'AsstProf', 'AssocProf', 'Prof', 'Prof', 'AssocProf', 'Prof', 'Prof',
        'Prof'],
       dtype='object', name='rank'),
 Index(['discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [ ]:
df.ndim

2

In [ ]:
df.size

390

In [ ]:
df.shape

(78, 5)

In [ ]:
df.values

array([['B', 56, 49, 'Male', 186960],
       ['A', 12, 6, 'Male', 93000],
       ['A', 23, 20, 'Male', 110515],
       ['A', 40, 31, 'Male', 131205],
       ['B', 20, 18, 'Male', 104800],
       ['A', 20, 20, 'Male', 122400],
       ['A', 20, 17, 'Male', 81285],
       ['A', 18, 18, 'Male', 126300],
       ['A', 29, 19, 'Male', 94350],
       ['A', 51, 51, 'Male', 57800],
       ['B', 39, 33, 'Male', 128250],
       ['B', 23, 23, 'Male', 134778],
       ['B', 1, 0, 'Male', 88000],
       ['B', 35, 33, 'Male', 162200],
       ['B', 25, 19, 'Male', 153750],
       ['B', 17, 3, 'Male', 150480],
       ['B', 8, 3, 'Male', 75044],
       ['B', 4, 0, 'Male', 92000],
       ['A', 19, 7, 'Male', 107300],
       ['A', 29, 27, 'Male', 150500],
       ['B', 4, 4, 'Male', 92000],
       ['A', 33, 30, 'Male', 103106],
       ['A', 4, 2, 'Male', 73000],
       ['A', 2, 0, 'Male', 85000],
       ['A', 30, 23, 'Male', 91100],
       ['B', 35, 31, 'Male', 99418],
       ['A', 38, 19, 'Male', 148750],
       ['A', 45, 43, 'Male', 155865],
       ['B', 7, 2, 'Male', 91300],
       ['B', 21, 20, 'Male', 123683],
       ['B', 9, 7, 'Male', 107008],
       ['B', 22, 21, 'Male', 155750],
       ['A', 27, 19, 'Male', 103275],
       ['B', 18, 18, 'Male', 120000],
       ['B', 12, 8, 'Male', 119800],
       ['B', 28, 23, 'Male', 126933],
       ['B', 45, 45, 'Male', 146856],
       ['A', 20, 8, 'Male', 102000],
       ['B', 4, 3, 'Male', 91000],
       ['B', 18, 18, 'Female', 129000],
       ['A', 39, 36, 'Female', 137000],
       ['A', 13, 8, 'Female', 74830],
       ['B', 4, 2, 'Female', 80225],
       ['B', 5, 0, 'Female', 77000],
       ['B', 23, 19, 'Female', 151768],
       ['B', 25, 25, 'Female', 140096],
       ['B', 11, 3, 'Female', 74692],
       ['B', 11, 11, 'Female', 103613],
       ['B', 17, 17, 'Female', 111512],
       ['B', 17, 18, 'Female', 122960],
       ['B', 10, 5, 'Female', 97032],
       ['B', 20, 14, 'Female', 127512],
       ['A', 12, 0, 'Female', 105000],
       ['A', 5, 3, 'Female', 73500],
       ['A', 25, 22, 'Female', 62884],
       ['A', 2, 0, 'Female', 72500],
       ['A', 10, 8, 'Female', 77500],
       ['A', 3, 1, 'Female', 72500],
       ['B', 36, 26, 'Female', 144651],
       ['B', 12, 10, 'Female', 103994],
       ['B', 3, 3, 'Female', 92000],
       ['B', 13, 10, 'Female', 103750],
       ['B', 14, 7, 'Female', 109650],
       ['A', 29, 27, 'Female', 91000],
       ['A', 26, 24, 'Female', 73300],
       ['A', 36, 19, 'Female', 117555],
       ['A', 7, 6, 'Female', 63100],
       ['A', 17, 11, 'Female', 90450],
       ['A', 4, 2, 'Female', 77500],
       ['A', 28, 7, 'Female', 116450],
       ['A', 8, 3, 'Female', 78500],
       ['B', 12, 9, 'Female', 71065],
       ['B', 24, 15, 'Female', 161101],
       ['B', 18, 10, 'Female', 105450],
       ['B', 19, 6, 'Female', 104542],
       ['B', 17, 17, 'Female', 124312],
       ['A', 28, 14, 'Female', 109954],
       ['A', 23, 15, 'Female', 109646]], dtype=object)

In [ ]:
df.head(5),df.tail(5)

(     discipline  phd  service   sex  salary
 rank
 Prof          B   56       49  Male  186960
 Prof          A   12        6  Male   93000
 Prof          A   23       20  Male  110515
 Prof          A   40       31  Male  131205
 Prof          B   20       18  Male  104800,
           discipline  phd  service     sex  salary
 rank
 Prof               B   18       10  Female  105450
 AssocProf          B   19        6  Female  104542
 Prof               B   17       17  Female  124312
 Prof               A   28       14  Female  109954
 Prof               A   23       15  Female  109646)

In [ ]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [ ]:
df.max(),df.min()

(discipline         B
 phd               56
 service           51
 sex             Male
 salary        186960
 dtype: object, discipline         A
 phd                1
 service            0
 sex           Female
 salary         57800
 dtype: object)

In [ ]:
df.mean(),df.median()

(phd            19.705128
 service        15.051282
 salary     108023.782051
 dtype: float64, phd            18.5
 service        14.5
 salary     104671.0
 dtype: float64)

In [ ]:
df.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [ ]:
df.sample(10)

          discipline  phd  service     sex  salary
rank
Prof               B   21       20    Male  123683
Prof               B   24       15  Female  161101
AsstProf           A    3        1  Female   72500
AsstProf           B    4        3    Male   91000
AsstProf           B    5        0  Female   77000
Prof               B   17       17  Female  124312
Prof               B   18       10  Female  105450
AsstProf           A    2        0  Female   72500
AssocProf          B    9        7    Male  107008
Prof               A   17       11  Female   90450

In [ ]:
df.dropna()

          discipline  phd  service     sex  salary
rank
Prof               B   56       49    Male  186960
Prof               A   12        6    Male   93000
Prof               A   23       20    Male  110515
Prof               A   40       31    Male  131205
Prof               B   20       18    Male  104800
...              ...  ...      ...     ...     ...
Prof               B   18       10  Female  105450
AssocProf          B   19        6  Female  104542
Prof               B   17       17  Female  124312
Prof               A   28       14  Female  109954
Prof               A   23       15  Female  109646

[78 rows x 5 columns]

In [ ]:
df.describe(),df.std()

(             phd    service         salary
 count  78.000000  78.000000      78.000000
 mean   19.705128  15.051282  108023.782051
 std    12.498425  12.139768   28293.661022
 min     1.000000   0.000000   57800.000000
 25%    10.250000   5.250000   88612.500000
 50%    18.500000  14.500000  104671.000000
 75%    27.750000  20.750000  126774.750000
 max    56.000000  51.000000  186960.000000, phd           12.498425
 service       12.139768
 salary     28293.661022
 dtype: float64)

Calculate the basic statistics for the Phd column

In [ ]:
df['phd'].describe()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

# Find how many values in Phd column(use **count** method

In [ ]:
df['phd'].count()

78

Calculate the avg Phd

In [ ]:
df['phd'].mean()

19.705128205128204

In [ ]:
df[['phd']].mean()

phd    19.705128
dtype: float64

In [ ]:
df.groupby(['rank']).mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [ ]:
df.groupby('rank')[['service','salary']].mean()

             service         salary
rank
AssocProf  11.307692   91786.230769
AsstProf    2.210526   81362.789474
Prof       21.413043  123624.804348

# **Filtering**

In [ ]:
df_sub = df[df['salary'] > 150000]

In [ ]:
df_sub

     discipline  phd  service     sex  salary
rank
Prof          B   56       49    Male  186960
Prof          B   35       33    Male  162200
Prof          B   25       19    Male  153750
Prof          B   17        3    Male  150480
Prof          A   29       27    Male  150500
Prof          A   45       43    Male  155865
Prof          B   22       21    Male  155750
Prof          B   23       19  Female  151768
Prof          B   24       15  Female  161101

In [ ]:
df[(df['discipline']=='B') & (df['phd']>=20)]

     discipline  phd  service     sex  salary  B  A
rank
Prof          B   56       49    Male  186960  B  B
Prof          B   20       18    Male  104800  B  B
Prof          B   39       33    Male  128250  B  B
Prof          B   23       23    Male  134778  B  B
Prof          B   35       33    Male  162200  B  B
Prof          B   25       19    Male  153750  B  B
Prof          B   35       31    Male   99418  B  B
Prof          B   21       20    Male  123683  B  B
Prof          B   22       21    Male  155750  B  B
Prof          B   28       23    Male  126933  B  B
Prof          B   45       45    Male  146856  B  B
Prof          B   23       19  Female  151768  B  B
Prof          B   25       25  Female  140096  B  B
Prof          B   20       14  Female  127512  B  B
Prof          B   36       26  Female  144651  B  B
Prof          B   24       15  Female  161101  B  B

In [ ]:
df.reindex()

          discipline  phd  service     sex  salary  B  A
rank
Prof               B   56       49    Male  186960  B  B
Prof               A   12        6    Male   93000  B  B
Prof               A   23       20    Male  110515  B  B
Prof               A   40       31    Male  131205  B  B
Prof               B   20       18    Male  104800  B  B
...              ...  ...      ...     ...     ... .. ..
Prof               B   18       10  Female  105450  B  B
AssocProf          B   19        6  Female  104542  B  B
Prof               B   17       17  Female  124312  B  B
Prof               A   28       14  Female  109954  B  B
Prof               A   23       15  Female  109646  B  B

[78 rows x 7 columns]

In [ ]:
df.iloc[1:4, 0:3]

     discipline  phd  service
rank
Prof          A   12        6
Prof          A   23       20
Prof          A   40       31

In [ ]:
df.iloc[[0,1],[-2,-1]]

      B  A
rank
Prof  B  B
Prof  B  B

In [10]:
df.reindex()

          discipline  phd  service     sex  salary
rank
Prof               B   56       49    Male  186960
Prof               A   12        6    Male   93000
Prof               A   23       20    Male  110515
Prof               A   40       31    Male  131205
Prof               B   20       18    Male  104800
...              ...  ...      ...     ...     ...
Prof               B   18       10  Female  105450
AssocProf          B   19        6  Female  104542
Prof               B   17       17  Female  124312
Prof               A   28       14  Female  109954
Prof               A   23       15  Female  109646

[78 rows x 5 columns]

Top 2 Row, last 2 column

In [17]:
df.iloc[0:2,3:]

       sex  salary
rank
Prof  Male  186960
Prof  Male   93000

# 2,3 row , 2,3,4 column

In [18]:
df.iloc[2:4,2:5]

      service   sex  salary
rank
Prof       20  Male  110515
Prof       31  Male  131205

# last 3 rows , first 3 columns

In [19]:
df.iloc[-3:,0:3]

     discipline  phd  service
rank
Prof          B   17       17
Prof          A   28       14
Prof          A   23       15